import sys
sys.stdin = open("input.txt","r")


"""
로봇 청소기와 방의 상태가 주어졌을 때, 청소하는 영역의 개수를 구하는 프로그램을 작성하시오.

로봇 청소기가 있는 방은 
$N \times M$ 크기의 직사각형으로 나타낼 수 있으며, 
$1 \times 1$ 크기의 정사각형 칸으로 나누어져 있다. 각각의 칸은 벽 또는 빈 칸이다. 청소기는 바라보는 방향이 있으며, 이 방향은 동, 서, 남, 북 중 하나이다. 방의 각 칸은 좌표 
$(r, c)$로 나타낼 수 있고, 가장 북쪽 줄의 가장 서쪽 칸의 좌표가 
$(0, 0)$, 가장 남쪽 줄의 가장 동쪽 칸의 좌표가 
$(N-1, M-1)$이다. 즉, 좌표 
$(r, c)$는 북쪽에서 
$(r+1)$번째에 있는 줄의 서쪽에서 
$(c+1)$번째 칸을 가리킨다. 처음에 빈 칸은 전부 청소되지 않은 상태이다.

로봇 청소기는 다음과 같이 작동한다.

현재 칸이 아직 청소되지 않은 경우, 현재 칸을 청소한다.
현재 칸의 주변 
$4$칸 중 청소되지 않은 빈 칸이 없는 경우,
바라보는 방향을 유지한 채로 한 칸 후진할 수 있다면 한 칸 후진하고 1번으로 돌아간다.
바라보는 방향의 뒤쪽 칸이 벽이라 후진할 수 없다면 작동을 멈춘다.
현재 칸의 주변 
$4$칸 중 청소되지 않은 빈 칸이 있는 경우,
반시계 방향으로 
$90^\circ$ 회전한다.
바라보는 방향을 기준으로 앞쪽 칸이 청소되지 않은 빈 칸인 경우 한 칸 전진한다.
1번으로 돌아간다.
입력
첫째 줄에 방의 크기 
$N$과 
$M$이 입력된다. 
$(3 \le N, M \le 50)$  둘째 줄에 처음에 로봇 청소기가 있는 칸의 좌표 
$(r, c)$와 처음에 로봇 청소기가 바라보는 방향 
$d$가 입력된다. 
$d$가 
$0$인 경우 북쪽, 
$1$인 경우 동쪽, 
$2$인 경우 남쪽, 
$3$인 경우 서쪽을 바라보고 있는 것이다.

셋째 줄부터 
$N$개의 줄에 각 장소의 상태를 나타내는 
$N \times M$개의 값이 한 줄에 
$M$개씩 입력된다. 
$i$번째 줄의 
$j$번째 값은 칸 
$(i, j)$의 상태를 나타내며, 이 값이 
$0$인 경우 
$(i, j)$가 청소되지 않은 빈 칸이고, 
$1$인 경우 
$(i, j)$에 벽이 있는 것이다. 방의 가장 북쪽, 가장 남쪽, 가장 서쪽, 가장 동쪽 줄 중 하나 이상에 위치한 모든 칸에는 벽이 있다. 로봇 청소기가 있는 칸은 항상 빈 칸이다.

출력
로봇 청소기가 작동을 시작한 후 작동을 멈출 때까지 청소하는 칸의 개수를 출력한다.


예제 1
3 3
1 1 0
1 1 1
1 0 1
1 1 1

출력 1
1

예제 2
11 10
7 4 0
1 1 1 1 1 1 1 1 1 1
1 0 0 0 0 0 0 0 0 1
1 0 0 0 1 1 1 1 0 1
1 0 0 1 1 0 0 0 0 1
1 0 1 1 0 0 0 0 0 1
1 0 0 0 0 0 0 0 0 1
1 0 0 0 0 0 0 1 0 1
1 0 0 0 0 0 1 1 0 1
1 0 0 0 0 0 1 1 0 1
1 0 0 0 0 0 0 0 0 1
1 1 1 1 1 1 1 1 1 1


출력 2
57

"""
N, M = map(int,input().split())
r,c,d = map(int,input().split())
rooms = [list(map(int,input().split())) for _ in range(N)]


# 북,동,남,서
dr = [-1,0,1,0]
dc = [0,1,0,-1]

# 방문했다는 걸 표시하기 위한 배열
visited = [[0] * M for _ in range(N)]

# 시작시 처음 로봇청소기의 자리는 방문 체크 해주기!
visited[r][c] = 1
cnt = 1  # 청소한 영역의 개수

while True:  # 여기는 너무 기본적인 bfs 알고리즘인데..
    flag = 0  # 아직 아무것도 청소 안했음.

    for _ in range(4):
        d = (d+3) % 4  # 왼쪽 방향으로 틀어줌.
        nr = r + dr[d]
        nc = c + dc[d]

        if 0 <= nr < N and 0 <= nc < M and rooms[nr][nc] == 0 and visited[nr][nc] == 0:
            visited[nr][nc] = 1 # 방문 체크 해주고
            cnt += 1  # 청소한 영역 개수 증가
            r , c = nr , nc  # 위치 갱신,
            flag = 1  # (nr,nc) 청소함을 저장해주고
            break

    if flag == 0:  # 범위 안에 들지 못했을 때
        # 즉, 4개의 방향을 다 청소하지 못할 때
        # 후진했을 때 벽이라면 break
        # 만약 벽이 아니면 그 위치 다시 갱신
        if rooms[r - dr[d]][c - dc[d]] == 1:  # r - dr[d], c - dc[d]는 후진했을 때의 좌표가 1이면, 즉 벽이면,
            print(cnt)
            break # 끝, break
        else:
            r, c = r - dr[d], c - dc[d]







