"""
백준 실버 2 이동하기 : https://www.acmicpc.net/problem/11048

준규는 N×M 크기의 미로에 갇혀있다. 미로는 1×1크기의 방으로 나누어져 있고, 각 방에는 사탕이 놓여져 있다. 미로의 가장 왼쪽 윗 방은 (1, 1)이고, 가장 오른쪽 아랫 방은 (N, M)이다.

준규는 현재 (1, 1)에 있고, (N, M)으로 이동하려고 한다. 준규가 (r, c)에 있으면, (r+1, c), (r, c+1), (r+1, c+1)로 이동할 수 있고, 각 방을 방문할 때마다 방에 놓여져있는 사탕을 모두 가져갈 수 있다. 또, 미로 밖으로 나갈 수는 없다.

준규가 (N, M)으로 이동할 때, 가져올 수 있는 사탕 개수의 최댓값을 구하시오.

첫째 줄에 미로의 크기 N, M이 주어진다. (1 ≤ N, M ≤ 1,000)

둘째 줄부터 N개 줄에는 총 M개의 숫자가 주어지며, r번째 줄의 c번째 수는 (r, c)에 놓여져 있는 사탕의 개수이다. 사탕의 개수는 0보다 크거나 같고, 100보다 작거나 같다.

첫째 줄에 준규가 (N, M)으로 이동할 때, 가져올 수 있는 사탕 개수를 출력한다.

예제 1
3 4
1 2 3 4
0 0 0 5
9 8 7 6

출력 1
31

예제 2
3 3
1 0 0
0 1 0
0 0 1

출력 2
3

예제 3
4 3
1 2 3
6 5 4
7 8 9
12 11 10

출력 3
47

"""

import sys
sys.stdin = open("input.txt","r")

N , M = map(int,input().split())

nums = [list(map(int,input().split())) for _ in range(N)]

dp = [[0] * (M+1) for _ in range(N+1)]

for i in range(1,N+1):
    for j in range(1,M+1):
        dp[i][j] = max(dp[i][j-1], dp[i-1][j]) + nums[i-1][j-1]  # nums[i-1][j-1]에 있는 값을 더하는거야.

print(dp[N][M])
